In [1]:
import pandas as pd

## CUSTOMER

In [2]:
customer_df = pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Customers.csv', encoding='latin1')
customer_df

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3/25/1936
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2/16/1992
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11/9/1937
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10/12/1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8/18/1965

In [3]:
customer_df.isnull().sum() #checks the null value

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [4]:
# Convert Birthday to datetime format
customer_df['Birthday'] = pd.to_datetime(customer_df['Birthday'], format='%m/%d/%Y')

customer_df.head(3)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26

In [5]:
#converting datatypes for further analysis
customer_df['Gender'] = customer_df['Gender'].astype('category')
customer_df['CustomerKey'] =customer_df['CustomerKey'].astype(int)
customer_df['Zip Code'] = customer_df['Zip Code'].astype(str)
customer_df['State Code'] =customer_df['State Code'].astype(str)

In [6]:
customer_df.dtypes   #checks the datatype

CustomerKey             int64
Gender               category
Name                   object
City                   object
State Code             object
State                  object
Zip Code               object
Country                object
Continent              object
Birthday       datetime64[ns]
dtype: object

In [7]:
#check duplicate rows
print(customer_df.duplicated().sum())

0

In [8]:
customer_df.info() #provides the information about the file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  category
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: category(1), datetime64[ns](1), int64(1), object(7)
memory usage: 1.1+ MB

In [9]:
# Fill missing values in 'State Code' with 'Unknown'
customer_df['State Code'].fillna('Unknown')

0         SA
1         WA
2        VIC
3         SA
4        VIC
        ...
15261     TX
15262     VA
15263     NC
15264     CA
15265     MI
Name: State Code, Length: 15266, dtype: object

In [10]:
customer_df.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [11]:
# Save the cleaned data to a new CSV file
customer_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_customer.csv')

## PRODUCT

In [12]:
products_df=pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Products.csv',encoding='latin1')
products_df

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [13]:
products_df.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [14]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [15]:
products_df.dtypes

ProductKey         int64
Product Name      object
Brand             object
Color             object
Unit Cost USD     object
Unit Price USD    object
SubcategoryKey     int64
Subcategory       object
CategoryKey        int64
Category          object
dtype: object

In [16]:
#removing dollar sign and commas
products_df['Unit Cost USD'] = products_df['Unit Cost USD'].replace({r'\$': '', ',': ''}, regex=True)
products_df['Unit Price USD'] = products_df['Unit Price USD'].replace({r'\$': '', ',': ''}, regex=True)
#converting to nummeric
products_df['Unit Cost USD'] = pd.to_numeric(products_df['Unit Cost USD'], errors='coerce')
products_df['Unit Price USD'] = pd.to_numeric(products_df['Unit Price USD'], errors='coerce')
products_df.head(3)  #prints only starting 3 lines of rows

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio

In [17]:
# Convert categorical columns to category type in order to reduce memory usage
categorical_col = ['Product Name', 'Brand', 'Color', 'Subcategory', 'Category']
for col in categorical_col:
    products_df[col] = products_df[col].astype('category')

# Checks the data types 
products_df.dtypes

ProductKey           int64
Product Name      category
Brand             category
Color             category
Unit Cost USD      float64
Unit Price USD     float64
SubcategoryKey       int64
Subcategory       category
CategoryKey          int64
Category          category
dtype: object

In [18]:
products_df.duplicated().sum()

np.int64(0)

In [19]:
products_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_products.csv')

## SALES

In [20]:
sales_df=pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Sales.csv',encoding='latin1')
sales_df

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [21]:
sales_df.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [22]:
sales_df.dtypes

Order Number      int64
Line Item         int64
Order Date       object
Delivery Date    object
CustomerKey       int64
StoreKey          int64
ProductKey        int64
Quantity          int64
Currency Code    object
dtype: object

In [23]:
print(f"Number of duplicate rows: {sales_df.duplicated().sum()}")

Number of duplicate rows: 0

In [24]:
#converting to datetime format
sales_df['Order Date'] = pd.to_datetime(sales_df['Order Date'], errors='coerce')
sales_df['Delivery Date'] = pd.to_datetime(sales_df['Delivery Date'], errors='coerce')
sales_df.head(3)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD

In [25]:
# converting quantity to numeric
sales_df['Quantity'] = pd.to_numeric(sales_df['Quantity'], errors='coerce')
# Fills missing quantities with 0
sales_df['Quantity'] = sales_df['Quantity'].fillna(0)  
# Removes rows where Quantity is 0 or less 
sales_df = sales_df[sales_df['Quantity'] > 0]

In [26]:
sales_df['Currency Code'].unique()   # checking unique currency codes

array(['CAD', 'USD', 'GBP', 'EUR', 'AUD'], dtype=object)

In [27]:
sales_df['Currency Code'] = sales_df['Currency Code'].str.upper() #converting lower case to upper case

In [28]:
# Use a more understandable placeholder for missing delivery dates
sales_df['Delivery Date'] = sales_df['Delivery Date'].fillna('Not Delivered Yet')
print(sales_df.isnull().sum())

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [29]:
sales_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_sales.csv', index=False)

## STORES

In [3]:
import pandas as pd
stores_df=pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Stores.csv',encoding='latin1')
stores_df

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [4]:
stores_df.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [5]:
# Fill missing Square Meters with the median value
stores_df['Square Meters'].fillna(stores_df['Square Meters'].median())

0      595.0
1      665.0
2     2000.0
3     2000.0
4     2000.0
       ...
62    2000.0
63    1330.0
64    1785.0
65     840.0
66    1347.5
Name: Square Meters, Length: 67, dtype: float64

In [6]:
stores_df.dtypes

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [7]:
# Convert Open Date to datetime format
stores_df['Open Date'] = pd.to_datetime(stores_df['Open Date'], errors='coerce')

# Convert 'quare Meters to numeric (if not already)
stores_df['Square Meters'] = pd.to_numeric(stores_df['Square Meters'], errors='coerce')
print(stores_df.duplicated().sum())

0

In [8]:
#Standardizing the country and state name
stores_df['Country'] = stores_df['Country'].str.strip().str.title()
stores_df['State'] = stores_df['State'].str.strip().str.title()

In [11]:
stores_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_stores.csv', index=False)

## EXCHANGE RATES

In [37]:
exchange_rates_df=pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Exchange_Rates.csv',encoding='latin1')
exchange_rates_df

            Date Currency  Exchange
0       1/1/2015      USD    1.0000
1       1/1/2015      CAD    1.1583
2       1/1/2015      AUD    1.2214
3       1/1/2015      EUR    0.8237
4       1/1/2015      GBP    0.6415
...          ...      ...       ...
11210  2/20/2021      USD    1.0000
11211  2/20/2021      CAD    1.2610
11212  2/20/2021      AUD    1.2723
11213  2/20/2021      EUR    0.8238
11214  2/20/2021      GBP    0.7126

[11215 rows x 3 columns]

In [38]:
exchange_rates_df.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [39]:
exchange_rates_df.dtypes

Date         object
Currency     object
Exchange    float64
dtype: object

In [40]:
# Convert 'Date' column to datetime format
exchange_rates_df['Date'] = pd.to_datetime(exchange_rates_df['Date'], format='%m/%d/%Y')
#converting to numeric 
exchange_rates_df['Exchange'] = pd.to_numeric(exchange_rates_df['Exchange'], errors='coerce')
print(exchange_rates_df.duplicated().sum())

0

In [41]:
exchange_rates_df['Currency'].unique()

array(['USD', 'CAD', 'AUD', 'EUR', 'GBP'], dtype=object)

In [42]:
exchange_rates_df.sort_values(by='Date', inplace=True)

In [43]:
exchange_rates_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_exchange_rates.csv', index=False)

## DATA DICTIONARY

In [44]:
dd_df=pd.read_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\DataSet\Data_Dictionary.csv',encoding='latin1')
dd_df

,Table,Field,Description
0,Sales,Order Number,Unique ID for each order
1,Sales,Line Item,Identifies individual products purchased as pa...
2,Sales,Order Date,Date the order was placed
3,Sales,Delivery Date,Date the order was delivered
4,Sales,CustomerKey,Unique key identifying which customer placed t...
5,Sales,StoreKey,Unique key identifying which store processed t...
6,Sales,ProductKey,Unique key identifying which product was purch...
7,Sales,Quantity,Number of items purchased
8,Sales,Currency Code,Currency used to process the order
9,Customers,CustomerKey,Primary key to identify customers
10,Customers,Gender,Customer gender
11,Customers,Name,Customer full name
12,Customers,City,Customer city
13,Customers,State Code,Customer state (abbreviated)
14,Customers,State,Customer state (full)
15,Customers,Zip Code,Customer zip code
16,Customers,Country,Customer country
17,Customers,Continent,Customer continent
18,Customers,Birthday,Customer date of birth
19,Products,ProductKey,Primary key to identify products
20,Products,Product Name,Product name
21,Products,Brand,Product brand
22,Products,Color,Product color
23,Products,Unit Cost USD,Cost to produce the product in USD
24,Products,Unit Price USD,Product list price in USD
25,Products,SubcategoryKey,Key to identify product subcategories
26,Products,Subcategory,Product subcategory name
27,Products,CategoryKey,Key to identify product categories
28,Products,Category,Product category name
29,Stores,StoreKey,Primary key to identify stores
30,Stores,Country,Store country
31,Stores,State,Store state
32,Stores,Square Meters,Store footprint in square meters
33,Stores,Open Date,Store open date
34,Exchange Rates,Date,Date
35,Exchange Rates,Currency,Currency code
36,Exchange Rates,Exchange,Exchange rate compared to USD

In [45]:
dd_df.isnull().sum()

Table          0
Field          0
Description    0
dtype: int64

In [46]:
dd_df.dtypes

Table          object
Field          object
Description    object
dtype: object

In [47]:
dd_df.to_csv(r'C:\Users\Priyanka Malavade\Desktop\Data Spark\cleaned_dataset\cleaned_data_dictionary.csv',index=False)